<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"4bcb989dcf311c4250a1fa2ca9eccf49939a15feb00c9c1b5f747a5aef2136c6","plan_job_ref":"Job Run Terraform plan in staging #155 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12751990780","plan_out_hash":"6c78be3fd19687149d832de4790eb161aba7837c141f2224ba5520ae26a6ccca","plan_hash":"0d82e66c27d0ec35f5619dd2c1341d656c5571372568129f20833ecafea9c954","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "continuous_monitoring-staging"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      source_code_hash            = "3kp/jcgTRD6afJ9fqfYtx6Ys/Amyd3V+9VxmsVqTsxg=" -> "scqEFvTPLCJth0J/5h/ZvG7MdbQlYv73CS4OAncpJsk="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-10T22:11:34Z" -> (known after apply)
#        (13 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #155](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12751990780)